note/drawio/converted/dot/260420-uart-1.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_UGjPlsAckatZPpFdG2PR_1" [label="IDEL"];
  "n_UGjPlsAckatZPpFdG2PR_11" [label="START"];
  "n_UGjPlsAckatZPpFdG2PR_119" [label="baut_tick == 1"];
  "n_UGjPlsAckatZPpFdG2PR_120" [label="F"];
  "n_UGjPlsAckatZPpFdG2PR_121" [label="T"];
  "n_UGjPlsAckatZPpFdG2PR_125" [label="WAIT"];
  "n_UGjPlsAckatZPpFdG2PR_129" [label="baut_tick == 1"];
  "n_UGjPlsAckatZPpFdG2PR_13" [label="T"];
  "n_UGjPlsAckatZPpFdG2PR_134" [label="baut_tick == 1"];
  "n_UGjPlsAckatZPpFdG2PR_135" [label="baut_tick == 1"];
  "n_UGjPlsAckatZPpFdG2PR_2" [label="start == 1"];
  "n_UGjPlsAckatZPpFdG2PR_34" [label="TX = 0"];
  "n_UGjPlsAckatZPpFdG2PR_36" [label="bit0"];
  "n_UGjPlsAckatZPpFdG2PR_38" [label="TX = data[0]"];
  "n_UGjPlsAckatZPpFdG2PR_41" [label="START"];
  "n_UGjPlsAckatZPpFdG2PR_5" [label="TX = 1"];
  "n_UGjPlsAckatZPpFdG2PR_7" [label="IDLE"];
  "n_UGjPlsAckatZPpFdG2PR_81" [label="bit2"];
  "n_UGjPlsAckatZPpFdG2PR_82" [label="TX = data[2]"];
  "n_UGjPlsAckatZPpFdG2PR_9" [label="F"];
  "n_UGjPlsAckatZPpFdG2PR_98" [label="STOP"];
  "n_lQCQZTKk_LeILsxmWH9y_11" [label="START"];
  "n_lQCQZTKk_LeILsxmWH9y_12" [label="T"];
  "n_lQCQZTKk_LeILsxmWH9y_14" [label="TX = 0"];
  "n_lQCQZTKk_LeILsxmWH9y_15" [label="START"];
  "n_lQCQZTKk_LeILsxmWH9y_17" [label="baut_tick == 1"];
  "n_lQCQZTKk_LeILsxmWH9y_19" [label="F"];
  "n_lQCQZTKk_LeILsxmWH9y_2" [label="IDLE"];
  "n_lQCQZTKk_LeILsxmWH9y_20" [label="T"];
  "n_lQCQZTKk_LeILsxmWH9y_22" [label="WAIT"];
  "n_lQCQZTKk_LeILsxmWH9y_24" [label="baut_tick == 1"];
  "n_lQCQZTKk_LeILsxmWH9y_25" [label="F"];
  "n_lQCQZTKk_LeILsxmWH9y_26" [label="T"];
  "n_lQCQZTKk_LeILsxmWH9y_27" [label="DATA_TX"];
  "n_lQCQZTKk_LeILsxmWH9y_30" [label="TX = data[count]"];
  "n_lQCQZTKk_LeILsxmWH9y_31" [label="baut_tick == 1"];
  "n_lQCQZTKk_LeILsxmWH9y_33" [label="count == 7"];
  "n_lQCQZTKk_LeILsxmWH9y_35" [label="STOP"];
  "n_lQCQZTKk_LeILsxmWH9y_5" [label="start == 1"];
  "n_lQCQZTKk_LeILsxmWH9y_7" [label="TX = 1"];
  "n_lQCQZTKk_LeILsxmWH9y_8" [label="IDLE"];
  "n_lQCQZTKk_LeILsxmWH9y_9" [label="F"];
  "n_o1f4UlkyCeSKwryDGnv5_1" [label="baut_tick == 1"];
  "n_o1f4UlkyCeSKwryDGnv5_12" [label="F"];
  "n_o1f4UlkyCeSKwryDGnv5_4" [label="T"];
  "n_o1f4UlkyCeSKwryDGnv5_5" [label="T"];
  "n_o1f4UlkyCeSKwryDGnv5_6" [label="T"];
  "n_o1f4UlkyCeSKwryDGnv5_7" [label="F"];
  "n_o1f4UlkyCeSKwryDGnv5_9" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_11" [label="bit4"];
  "n_z6RQsE05kwIORvhBAqgg_12" [label="TX = data[4]"];
  "n_z6RQsE05kwIORvhBAqgg_13" [label="bit6"];
  "n_z6RQsE05kwIORvhBAqgg_14" [label="TX = data[6]"];
  "n_z6RQsE05kwIORvhBAqgg_15" [label="baut_tick == 1"];
  "n_z6RQsE05kwIORvhBAqgg_16" [label="baut_tick == 1"];
  "n_z6RQsE05kwIORvhBAqgg_18" [label="bit5"];
  "n_z6RQsE05kwIORvhBAqgg_19" [label="TX = data[5]"];
  "n_z6RQsE05kwIORvhBAqgg_20" [label="baut_tick == 1"];
  "n_z6RQsE05kwIORvhBAqgg_21" [label="bit7"];
  "n_z6RQsE05kwIORvhBAqgg_22" [label="TX = data[7]"];
  "n_z6RQsE05kwIORvhBAqgg_23" [label="baut_tick == 1"];
  "n_z6RQsE05kwIORvhBAqgg_4" [label="bit1"];
  "n_z6RQsE05kwIORvhBAqgg_42" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_43" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_44" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_45" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_46" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_47" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_48" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_49" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_5" [label="TX = data[1]"];
  "n_z6RQsE05kwIORvhBAqgg_51" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_52" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_6" [label="baut_tick == 1"];
  "n_z6RQsE05kwIORvhBAqgg_64" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_65" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_66" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_67" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_68" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_69" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_7" [label="bit3"];
  "n_z6RQsE05kwIORvhBAqgg_70" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_71" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_73" [label="TX = 1"];
  "n_z6RQsE05kwIORvhBAqgg_77" [label="baut_tick == 1"];
  "n_z6RQsE05kwIORvhBAqgg_79" [label="T"];
  "n_z6RQsE05kwIORvhBAqgg_8" [label="TX = data[3]"];
  "n_z6RQsE05kwIORvhBAqgg_81" [label="F"];
  "n_z6RQsE05kwIORvhBAqgg_9" [label="baut_tick == 1"];
  "n_UGjPlsAckatZPpFdG2PR_1" -> "n_UGjPlsAckatZPpFdG2PR_5";
  "n_UGjPlsAckatZPpFdG2PR_2" -> "n_UGjPlsAckatZPpFdG2PR_1";
  "n_UGjPlsAckatZPpFdG2PR_2" -> "n_UGjPlsAckatZPpFdG2PR_125";
  "n_UGjPlsAckatZPpFdG2PR_5" -> "n_UGjPlsAckatZPpFdG2PR_2";
  "n_UGjPlsAckatZPpFdG2PR_11" -> "n_UGjPlsAckatZPpFdG2PR_34";
  "n_UGjPlsAckatZPpFdG2PR_36" -> "n_UGjPlsAckatZPpFdG2PR_38";
  "n_UGjPlsAckatZPpFdG2PR_38" -> "n_UGjPlsAckatZPpFdG2PR_134";
  "n_UGjPlsAckatZPpFdG2PR_81" -> "n_UGjPlsAckatZPpFdG2PR_82";
  "n_UGjPlsAckatZPpFdG2PR_82" -> "n_UGjPlsAckatZPpFdG2PR_135";
  "n_UGjPlsAckatZPpFdG2PR_98" -> "n_z6RQsE05kwIORvhBAqgg_73";
  "n_UGjPlsAckatZPpFdG2PR_119" -> "n_UGjPlsAckatZPpFdG2PR_125";
  "n_UGjPlsAckatZPpFdG2PR_125" -> "n_UGjPlsAckatZPpFdG2PR_119";
  "n_UGjPlsAckatZPpFdG2PR_129" -> "n_UGjPlsAckatZPpFdG2PR_36";
  "n_UGjPlsAckatZPpFdG2PR_129" -> "n_UGjPlsAckatZPpFdG2PR_11";
  "n_UGjPlsAckatZPpFdG2PR_134" -> "n_z6RQsE05kwIORvhBAqgg_4";
  "n_UGjPlsAckatZPpFdG2PR_134" -> "n_UGjPlsAckatZPpFdG2PR_36";
  "n_UGjPlsAckatZPpFdG2PR_135" -> "n_z6RQsE05kwIORvhBAqgg_7";
  "n_UGjPlsAckatZPpFdG2PR_135" -> "n_UGjPlsAckatZPpFdG2PR_81";
  "n_z6RQsE05kwIORvhBAqgg_4" -> "n_z6RQsE05kwIORvhBAqgg_5";
  "n_z6RQsE05kwIORvhBAqgg_5" -> "n_z6RQsE05kwIORvhBAqgg_6";
  "n_z6RQsE05kwIORvhBAqgg_6" -> "n_UGjPlsAckatZPpFdG2PR_81";
  "n_z6RQsE05kwIORvhBAqgg_6" -> "n_z6RQsE05kwIORvhBAqgg_4";
  "n_z6RQsE05kwIORvhBAqgg_7" -> "n_z6RQsE05kwIORvhBAqgg_8";
  "n_z6RQsE05kwIORvhBAqgg_8" -> "n_z6RQsE05kwIORvhBAqgg_9";
  "n_z6RQsE05kwIORvhBAqgg_9" -> "n_z6RQsE05kwIORvhBAqgg_11";
  "n_z6RQsE05kwIORvhBAqgg_9" -> "n_z6RQsE05kwIORvhBAqgg_7";
  "n_z6RQsE05kwIORvhBAqgg_11" -> "n_z6RQsE05kwIORvhBAqgg_12";
  "n_z6RQsE05kwIORvhBAqgg_12" -> "n_z6RQsE05kwIORvhBAqgg_15";
  "n_z6RQsE05kwIORvhBAqgg_13" -> "n_z6RQsE05kwIORvhBAqgg_14";
  "n_z6RQsE05kwIORvhBAqgg_14" -> "n_z6RQsE05kwIORvhBAqgg_16";
  "n_z6RQsE05kwIORvhBAqgg_15" -> "n_z6RQsE05kwIORvhBAqgg_18";
  "n_z6RQsE05kwIORvhBAqgg_15" -> "n_z6RQsE05kwIORvhBAqgg_11";
  "n_z6RQsE05kwIORvhBAqgg_16" -> "n_z6RQsE05kwIORvhBAqgg_21";
  "n_z6RQsE05kwIORvhBAqgg_16" -> "n_z6RQsE05kwIORvhBAqgg_13";
  "n_z6RQsE05kwIORvhBAqgg_18" -> "n_z6RQsE05kwIORvhBAqgg_19";
  "n_z6RQsE05kwIORvhBAqgg_19" -> "n_z6RQsE05kwIORvhBAqgg_20";
  "n_z6RQsE05kwIORvhBAqgg_20" -> "n_z6RQsE05kwIORvhBAqgg_13";
  "n_z6RQsE05kwIORvhBAqgg_20" -> "n_z6RQsE05kwIORvhBAqgg_18";
  "n_z6RQsE05kwIORvhBAqgg_21" -> "n_z6RQsE05kwIORvhBAqgg_22";
  "n_z6RQsE05kwIORvhBAqgg_22" -> "n_z6RQsE05kwIORvhBAqgg_23";
  "n_z6RQsE05kwIORvhBAqgg_23" -> "n_z6RQsE05kwIORvhBAqgg_21";
  "n_z6RQsE05kwIORvhBAqgg_23" -> "n_UGjPlsAckatZPpFdG2PR_98";
  "n_z6RQsE05kwIORvhBAqgg_77" -> "n_UGjPlsAckatZPpFdG2PR_1";
  "n_z6RQsE05kwIORvhBAqgg_77" -> "n_UGjPlsAckatZPpFdG2PR_98";
  "n_lQCQZTKk_LeILsxmWH9y_2" -> "n_lQCQZTKk_LeILsxmWH9y_7";
  "n_lQCQZTKk_LeILsxmWH9y_5" -> "n_lQCQZTKk_LeILsxmWH9y_2";
  "n_lQCQZTKk_LeILsxmWH9y_5" -> "n_lQCQZTKk_LeILsxmWH9y_22";
  "n_lQCQZTKk_LeILsxmWH9y_7" -> "n_lQCQZTKk_LeILsxmWH9y_5";
  "n_lQCQZTKk_LeILsxmWH9y_11" -> "n_lQCQZTKk_LeILsxmWH9y_14";
  "n_lQCQZTKk_LeILsxmWH9y_17" -> "n_lQCQZTKk_LeILsxmWH9y_22";
  "n_lQCQZTKk_LeILsxmWH9y_22" -> "n_lQCQZTKk_LeILsxmWH9y_17";
  "n_lQCQZTKk_LeILsxmWH9y_24" -> "n_lQCQZTKk_LeILsxmWH9y_11";
  "n_lQCQZTKk_LeILsxmWH9y_24" -> "n_lQCQZTKk_LeILsxmWH9y_27";
  "n_lQCQZTKk_LeILsxmWH9y_27" -> "n_lQCQZTKk_LeILsxmWH9y_30";
  "n_lQCQZTKk_LeILsxmWH9y_30" -> "n_lQCQZTKk_LeILsxmWH9y_31";
  "n_lQCQZTKk_LeILsxmWH9y_31" -> "n_lQCQZTKk_LeILsxmWH9y_33";
  "n_lQCQZTKk_LeILsxmWH9y_33" -> "n_lQCQZTKk_LeILsxmWH9y_27";
  "n_lQCQZTKk_LeILsxmWH9y_33" -> "n_lQCQZTKk_LeILsxmWH9y_35";
  "n_lQCQZTKk_LeILsxmWH9y_35" -> "n_o1f4UlkyCeSKwryDGnv5_1";
  "n_o1f4UlkyCeSKwryDGnv5_1" -> "n_lQCQZTKk_LeILsxmWH9y_2";
  "n_o1f4UlkyCeSKwryDGnv5_1" -> "n_lQCQZTKk_LeILsxmWH9y_35";
  "n_lQCQZTKk_LeILsxmWH9y_31" -> "n_lQCQZTKk_LeILsxmWH9y_27";
}
